back_end_API/app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "nationality", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Arthur Conan Doyle"], ["nationality", "British"], ["created_at", "2018-11-25 11:18:41.857950"], ["updated_at", "2018-11-25 11:18:41.857950"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save