back_end_API/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asd"], ["author_id", 1], ["created_at", "2018-11-25 12:00:00.988413"], ["updated_at", "2018-11-25 12:00:00.988413"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save